import 'package:flutter/material.dart';

import 'mahmoed.dart';

class krin extends StatefulWidget {
  const krin({Key? key}) : super(key: key);

  @override
  State<krin> createState() => _krinState();
}

class _krinState extends State<krin> {

  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: AppBar(
          title: Text('سور من القران الكريم',

            style: TextStyle(
              color: Colors.teal.shade400,
              fontSize: 25,
            ),
          ),
          centerTitle:true ,
          elevation: 0,
          backgroundColor:Colors.teal.shade100,
        ),
      body: Container(
          height: MediaQuery.of(context).size.height*1,
          width: MediaQuery.of(context).size.width*1,
          decoration: BoxDecoration(
            image:DecorationImage(
              image:AssetImage(  'image/cvz.jpg',
              ),
              fit: BoxFit.fill,
            ),
          ),
          child: SingleChildScrollView(
            child:Column(
          children: [
            TextButton(onPressed:(){
        Navigator.push(context, MaterialPageRoute(
               builder: (context) =>mahmoed(
                 name: 'سورة الفاتحة',
                   sore:'بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ (1)\nٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ (2)ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ (3) مَٰلِكِ يَوۡمِ ٱلدِّينِ (4)إِيَّاكَ نَعۡبُدُ وَإِيَّاكَ نَسۡتَعِينُ (5) ٱهۡدِنَاٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ (6) صِرَٰطَ ٱلَّذِينَ أَنۡعَمۡتَ عَلَيۡهِمۡ غَيۡرِ ٱلۡمَغۡضُوبِ عَلَيۡهِم ۡوَلَا ٱلضَّآلِّينَ (7)',
                   musci:'1.mp3'

        )
        )
        );
        },
          child: leste('سورة الفاتحة')),
            TextButton(onPressed:(){
              Navigator.push(context, MaterialPageRoute(
                  builder: (context) =>mahmoed(
                      name: 'سورة الشمس',
                      sore:'بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيم \nوَٱلشَّمۡسِ وَضُحَىٰهَا (1) وَٱلۡقَمَرِ إِذَا تَلَىٰهَا (2) وَٱلنَّهَارِ إِذَا جَلَّىٰهَا (3) وَٱلَّيۡلِ إِذَا يَغۡشَىٰهَا (4) وَٱلسَّمَآءِ وَمَا بَنَىٰهَا (5) وَٱلۡأَرۡضِ وَمَا طَحَىٰهَا (6) وَنَفۡسٖ وَمَا سَوَّىٰهَا (7) فَأَلۡهَمَهَا فُجُورَهَا وَتَقۡوَىٰهَا (8) قَدۡ أَفۡلَحَ مَن زَكَّىٰهَا (9) وَقَدۡ خَابَ مَن دَسَّىٰهَا (10) كَذَّبَتۡ ثَمُودُ بِطَغۡوَىٰهَآ (11) إِذِ ٱنۢبَعَثَ أَشۡقَىٰهَا (12) فَقَالَ لَهُمۡ رَسُولُ ٱللَّهِ نَاقَةَ ٱللَّهِ وَسُقۡيَٰهَا (13) فَكَذَّبُوهُ فَعَقَرُوهَا فَدَمۡدَمَ عَلَيۡهِمۡ رَبُّهُم بِذَنۢبِهِمۡ فَسَوَّىٰهَا (14) وَلَا يَخَافُ عُقۡبَٰهَا (15)ِ',
                      musci:'18.mp3'

                  )
              )
              );
            },
                child: leste('سورة الشمس')),
            TextButton(onPressed:(){
              Navigator.push(context, MaterialPageRoute(
                  builder: (context) =>mahmoed(
                      name: 'سورة الليل',
                      sore:'بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ\nوَٱلَّيۡلِ إِذَا يَغۡشَىٰ (1) وَٱلنَّهَارِ إِذَا تَجَلَّىٰ (2) وَمَا خَلَقَ ٱلذَّكَرَ وَٱلۡأُنثَىٰٓ (3) إِنَّ سَعۡيَكُمۡ لَشَتَّىٰ (4) فَأَمَّا مَنۡ أَعۡطَىٰ وَٱتَّقَىٰ (5) وَصَدَّقَ بِٱلۡحُسۡنَىٰ (6) فَسَنُيَسِّرُهُۥ لِلۡيُسۡرَىٰ (7) وَأَمَّا مَنۢ بَخِلَ وَٱسۡتَغۡنَىٰ (8) وَكَذَّبَ بِٱلۡحُسۡنَىٰ (9) فَسَنُيَسِّرُهُۥ لِلۡعُسۡرَىٰ (10) وَمَا يُغۡنِي عَنۡهُ مَالُهُۥٓ إِذَا تَرَدَّىٰٓ (11) إِنَّ عَلَيۡنَا لَلۡهُدَىٰ (12) وَإِنَّ لَنَا لَلۡأٓخِرَةَ وَٱلۡأُولَىٰ (13) فَأَنذَرۡتُكُمۡ نَارٗا تَلَظَّىٰ (14) لَا يَصۡلَىٰهَآ إِلَّا ٱلۡأَشۡقَى (15) ٱلَّذِي كَذَّبَ وَتَوَلَّىٰ (16) وَسَيُجَنَّبُهَا ٱلۡأَتۡقَى (17) ٱلَّذِي يُؤۡتِي مَالَهُۥ يَتَزَكَّىٰ (18) وَمَا لِأَحَدٍ عِندَهُۥ مِن نِّعۡمَةٖ تُجۡزَىٰٓ (19) إِلَّا ٱبۡتِغَآءَ وَجۡهِ رَبِّهِ ٱلۡأَعۡلَىٰ (20) وَلَسَوۡفَ يَرۡضَىٰ (21)',
                      musci:'17.mp3'

                  )
              )
              );
            },
                child: leste('سورة الليل')),
            TextButton(onPressed:(){
              Navigator.push(context, MaterialPageRoute(
                  builder: (context) =>mahmoed(
                      name: 'سورة الضحى',
                      sore:'بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيم \nِوَٱلضُّحَىٰ (1) وَٱلَّيۡلِ إِذَا سَجَىٰ (2) مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَىٰ (3) وَلَلۡأٓخِرَةُ خَيۡرٞ لَّكَ مِنَ ٱلۡأُولَىٰ (4) وَلَسَوۡفَ يُعۡطِيكَ رَبُّكَ فَتَرۡضَىٰٓ (5) أَلَمۡ يَجِدۡكَ يَتِيمٗا فَـَٔاوَىٰ (6) وَوَجَدَكَ ضَآلّٗا فَهَدَىٰ (7) وَوَجَدَكَ عَآئِلٗا فَأَغۡنَىٰ (8) فَأَمَّا ٱلۡيَتِيمَ فَلَا تَقۡهَرۡ (9) وَأَمَّا ٱلسَّآئِلَ فَلَا تَنۡهَرۡ (10) وَأَمَّا بِنِعۡمَةِ رَبِّكَ فَحَدِّثۡ (11)',
                      musci:'15.mp3'

                  )
              )
              );
            },
                child: leste('سورة الضحى')),
            TextButton(onPressed:(){
              Navigator.push(context, MaterialPageRoute(
                  builder: (context) =>mahmoed(
                      name: 'سورة الشرح',
                      sore:'بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ \nأَلَمۡ نَشۡرَحۡ لَكَ صَدۡرَكَ (1) وَوَضَعۡنَا عَنكَ وِزۡرَكَ (2) ٱلَّذِيٓ أَنقَضَ ظَهۡرَكَ (3) وَرَفَعۡنَا لَكَ ذِكۡرَكَ (4) فَإِنَّ مَعَ ٱلۡعُسۡرِ يُسۡرًا (5) إِنَّ مَعَ ٱلۡعُسۡرِ يُسۡرٗا (6) فَإِذَا فَرَغۡتَ فَٱنصَبۡ (7) وَإِلَىٰ رَبِّكَ فَٱرۡغَب (8)',
                      musci:'16.mp3'

                  )
              )
              );
            },
                child: leste('سورة الشرح')),
            TextButton(onPressed:(){
              Navigator.push(context, MaterialPageRoute(
                  builder: (context) =>mahmoed(
                      name: 'سورة التين ',
                      sore:'بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ \nوَٱلتِّينِ وَٱلزَّيۡتُونِ (1) وَطُورِ سِينِينَ (2) وَهَٰذَا ٱلۡبَلَدِ ٱلۡأَمِينِ (3) لَقَدۡ خَلَقۡنَا ٱلۡإِنسَٰنَ فِيٓ أَحۡسَنِ تَقۡوِيمٖ (4) ثُمَّ رَدَدۡنَٰهُ أَسۡفَلَ سَٰفِلِينَ (5) إِلَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّـٰلِحَٰتِ فَلَهُمۡ أَجۡرٌ غَيۡرُ مَمۡنُونٖ (6) فَمَا يُكَذِّبُكَ بَعۡدُ بِٱلدِّينِ (7) أَلَيۡسَ ٱللَّهُ بِأَحۡكَمِ ٱلۡحَٰكِمِينَ (8)',
                      musci:'14.mp3'

                  )
              )
              );
            },
                child: leste('سورة التين')),
            TextButton(onPressed:(){
              Navigator.push(context, MaterialPageRoute(
                  builder: (context) =>mahmoed(
                      name: 'سورة القدر ',
                      sore:'بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ \n إِنَّآ أَنزَلۡنَٰهُ فِي لَيۡلَةِ ٱلۡقَدۡرِ (1) وَمَآ أَدۡرَىٰكَ مَا لَيۡلَةُ ٱلۡقَدۡرِ (2) لَيۡلَةُ ٱلۡقَدۡرِ خَيۡرٞ مِّنۡ أَلۡفِ شَهۡرٖ (3) تَنَزَّلُ ٱلۡمَلَـٰٓئِكَةُ وَٱلرُّوحُ فِيهَا بِإِذۡنِ رَبِّهِم مِّن كُلِّ أَمۡرٖ (4) سَلَٰمٌ هِيَ حَتَّىٰ مَطۡلَعِ ٱلۡفَجۡرِ (5)',
                      musci:'13.mp3'

                  )
              )
              );
            },
                child: leste('سورة القدر ')),
            TextButton(onPressed:(){
              Navigator.push(context, MaterialPageRoute(
                  builder: (context) =>mahmoed(
                      name: 'سورة الزلزلة ',
                      sore:'بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ \nإِذَا زُلۡزِلَتِ ٱلۡأَرۡضُ زِلۡزَالَهَا (1) وَأَخۡرَجَتِ ٱلۡأَرۡضُ أَثۡقَالَهَا (2) وَقَالَ ٱلۡإِنسَٰنُ مَا لَهَا (3) يَوۡمَئِذٖ تُحَدِّثُ أَخۡبَارَهَا (4) بِأَنَّ رَبَّكَ أَوۡحَىٰ لَهَا (5) يَوۡمَئِذٖ يَصۡدُرُ ٱلنَّاسُ أَشۡتَاتٗا لِّيُرَوۡاْ أَعۡمَٰلَهُمۡ (6) فَمَن يَعۡمَلۡ مِثۡقَالَ ذَرَّةٍ خَيۡرٗا يَرَهُۥ (7) وَمَن يَعۡمَلۡ مِثۡقَالَ ذَرَّةٖ شَرّٗا يَرَهُۥ (8)',
                      musci:'20.mp3'

                  )
              )
              );
            },
                child: leste('سورةالزلزلة ')),
            TextButton(onPressed:(){
              Navigator.push(context, MaterialPageRoute(
                  builder: (context) =>mahmoed(
                      name: 'سورة  العاديات',
                      sore:'بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ \nوَٱلۡعَٰدِيَٰتِ ضَبۡحٗا (1) فَٱلۡمُورِيَٰتِ قَدۡحٗا (2) فَٱلۡمُغِيرَٰتِ صُبۡحٗا (3) فَأَثَرۡنَ بِهِۦ نَقۡعٗا (4) فَوَسَطۡنَ بِهِۦ جَمۡعًا (5) إِنَّ ٱلۡإِنسَٰنَ لِرَبِّهِۦ لَكَنُودٞ (6) وَإِنَّهُۥ عَلَىٰ ذَٰلِكَ لَشَهِيدٞ (7) وَإِنَّهُۥ لِحُبِّ ٱلۡخَيۡرِ لَشَدِيدٌ (8) ۞أَفَلَا يَعۡلَمُ إِذَا بُعۡثِرَ مَا فِي ٱلۡقُبُورِ (9) وَحُصِّلَ مَا فِي ٱلصُّدُورِ (10) إِنَّ رَبَّهُم بِهِمۡ يَوۡمَئِذٖ لَّخَبِيرُۢ (11)',
                      musci:'21.mp3'

                  )
              )
              );
            },
                child: leste('سورة العاديات')),
            TextButton(onPressed:(){
              Navigator.push(context, MaterialPageRoute(
                  builder: (context) =>mahmoed(
                      name: 'سورة العصر ',
                      sore:'بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ \nوَٱلۡعَصۡرِ (1) إِنَّ ٱلۡإِنسَٰنَ لَفِي خُسۡرٍ (2) إِلَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّـٰلِحَٰتِ وَتَوَاصَوۡاْ بِٱلۡحَقِّ وَتَوَاصَوۡاْ بِٱلصَّبۡرِ (3)',
                      musci:'10.mp3'

                  )
              )
              );
            },
                child: leste('سورة العصر')),
            TextButton(onPressed:(){
              Navigator.push(context, MaterialPageRoute(
                  builder: (context) =>mahmoed(
                      name: 'سورة الهمزة ',
                      sore:'بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ \nوَيۡلٞ لِّكُلِّ هُمَزَةٖ لُّمَزَةٍ (1) ٱلَّذِي جَمَعَ مَالٗا وَعَدَّدَهُۥ (2) يَحۡسَبُ أَنَّ مَالَهُۥٓ أَخۡلَدَهُۥ (3) كَلَّاۖ لَيُنۢبَذَنَّ فِي ٱلۡحُطَمَةِ (4) وَمَآ أَدۡرَىٰكَ مَا ٱلۡحُطَمَةُ (5) نَارُ ٱللَّهِ ٱلۡمُوقَدَةُ (6) ٱلَّتِي تَطَّلِعُ عَلَى ٱلۡأَفۡـِٔدَةِ (7) إِنَّهَا عَلَيۡهِم مُّؤۡصَدَةٞ (8) فِي عَمَدٖ مُّمَدَّدَةِۢ (9)',
                      musci:'12.mp3'

                  )
              )
              );
            },
                child: leste('سورة الهمزة')),
            TextButton(onPressed:(){
              Navigator.push(context, MaterialPageRoute(
                  builder: (context) =>mahmoed(
                      name: 'سورة الفيل ',
                      sore:'بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ \nأَلَمۡ تَرَ كَيۡفَ فَعَلَ رَبُّكَ بِأَصۡحَٰبِ ٱلۡفِيلِ (1) أَلَمۡ يَجۡعَلۡ كَيۡدَهُمۡ فِي تَضۡلِيلٖ (2) وَأَرۡسَلَ عَلَيۡهِمۡ طَيۡرًا أَبَابِيلَ (3) تَرۡمِيهِم بِحِجَارَةٖ مِّن سِجِّيلٖ (4) فَجَعَلَهُمۡ كَعَصۡفٖ مَّأۡكُولِۢ (5)',
                      musci:'11.mp3'

                  )
              )
              );
            },
                child: leste('سورة الفيل')),
            TextButton(onPressed:(){
              Navigator.push(context, MaterialPageRoute(
                  builder: (context) =>mahmoed(
                      name: 'سورة قريش  ',
                      sore:'بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ \nإِيلَٰفِ قُرَيۡشٍ (1) إِۦلَٰفِهِمۡ رِحۡلَةَ ٱلشِّتَآءِ وَٱلصَّيۡفِ (2) فَلۡيَعۡبُدُواْ رَبَّ هَٰذَا ٱلۡبَيۡتِ (3) ٱلَّذِيٓ أَطۡعَمَهُم مِّن جُوعٖ وَءَامَنَهُم مِّنۡ خَوۡفِۢ (4)',
                      musci:'7.mp3'

                  )
              )
              );
            },
                child: leste('سورة قريش')),
            TextButton(onPressed:(){
              Navigator.push(context, MaterialPageRoute(
                  builder: (context) =>mahmoed(
                      name: 'سورة الماعون ',
                      sore:'بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ \nأَرَءَيۡتَ ٱلَّذِي يُكَذِّبُ بِٱلدِّينِ (1) فَذَٰلِكَ ٱلَّذِي يَدُعُّ ٱلۡيَتِيمَ (2) وَلَا يَحُضُّ عَلَىٰ طَعَامِ ٱلۡمِسۡكِينِ (3) فَوَيۡلٞ لِّلۡمُصَلِّينَ (4) ٱلَّذِينَ هُمۡ عَن صَلَاتِهِمۡ سَاهُونَ (5) ٱلَّذِينَ هُمۡ يُرَآءُونَ (6) وَيَمۡنَعُونَ ٱلۡمَاعُونَ (7)',
                      musci:'8.mp3'

                  )
              )
              );
            },
                child: leste('سورة الماعون')),
            TextButton(onPressed:(){
              Navigator.push(context, MaterialPageRoute(
                  builder: (context) =>mahmoed(
                      name: 'سورة الكوثر ',
                      sore:'بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ \nإِنَّآ أَعۡطَيۡنَٰكَ ٱلۡكَوۡثَرَ (1) فَصَلِّ لِرَبِّكَ وَٱنۡحَرۡ (2) إِنَّ شَانِئَكَ هُوَ ٱلۡأَبۡتَرُ (3)',
                      musci:'9.mp3'

                  )
              )
              );
            },
                child: leste('سورةالكوثر ')),
            TextButton(onPressed:(){
              Navigator.push(context, MaterialPageRoute(
                  builder: (context) =>mahmoed(
                      name: 'سورة الكافرون ',
                      sore:'بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ \nقُلۡ يَـٰٓأَيُّهَا ٱلۡكَٰفِرُونَ (1) لَآ أَعۡبُدُ مَا تَعۡبُدُونَ (2) وَلَآ أَنتُمۡ عَٰبِدُونَ مَآ أَعۡبُدُ (3) وَلَآ أَنَا۠ عَابِدٞ مَّا عَبَدتُّمۡ (4) وَلَآ أَنتُمۡ عَٰبِدُونَ مَآ أَعۡبُدُ (5) لَكُمۡ دِينُكُمۡ وَلِيَ دِينِ (6)',
                      musci:'5.mp3'

                  )
              )
              );
            },
                child: leste('سورة الكافرون ')),
            TextButton(onPressed:(){
              Navigator.push(context, MaterialPageRoute(
                  builder: (context) =>mahmoed(
                      name: 'سورة النصر  ',
                      sore:'بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ \nإِذَا جَآءَ نَصۡرُ ٱللَّهِ وَٱلۡفَتۡحُ (1) وَرَأَيۡتَ ٱلنَّاسَ يَدۡخُلُونَ فِي دِينِ ٱللَّهِ أَفۡوَاجٗا (2) فَسَبِّحۡ بِحَمۡدِ رَبِّكَ وَٱسۡتَغۡفِرۡهُۚ إِنَّهُۥ كَانَ تَوَّابَۢا (3)',
                      musci:'6.mp3'

                  )
              )
              );
            },
                child: leste('سورة النصر')),
            TextButton(onPressed:(){
              Navigator.push(context, MaterialPageRoute(
                  builder: (context) =>mahmoed(
                      name: 'سورة الاخلاص ',
                      sore:'بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ \nقُلۡ هُوَ ٱللَّهُ أَحَدٌ (1) ٱللَّهُ ٱلصَّمَدُ (2) لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ (3) وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ (4)',
                      musci:'2.mp3'

                  )
              )
              );
            },
                child: leste('سورة الاخلاص ')),
            TextButton(onPressed:(){
              Navigator.push(context, MaterialPageRoute(
                  builder: (context) =>mahmoed(
                      name: 'سورة الفلق ',
                      sore:'بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ \nقُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ (1) مِن شَرِّ مَا خَلَقَ (2) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِن شَرِّ ٱلنَّفَّـٰثَٰتِ فِي ٱلۡعُقَدِ (4) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ (5)',
                      musci:'3.mp3'

                  )
              )
              );
            },
                child: leste('سورة الفلق')),
            TextButton(onPressed:(){
              Navigator.push(context, MaterialPageRoute(
                  builder: (context) =>mahmoed(
                      name: 'سورة الناس ',
                      sore:'بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ \nِقُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ (1) مَلِكِ ٱلنَّاسِ (2) إِلَٰهِ ٱلنَّاسِ (3) مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ (4) ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ (5) مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ (6)',
                      musci:'4.mp3'

                  )
              )
              );
            },
                child: leste('سورة الناس')),
          ],
        ),
      ))
    );
  }
  leste(swws){
    return Padding(
        padding: const EdgeInsets.all(1),
    child:Container(
        decoration: BoxDecoration(
        borderRadius:BorderRadius.circular(15),
      color: Colors.white,),
      width: MediaQuery.of(context).size.width*1,
      height: 100,
      child:Center(child:  Text('$swws',
        textAlign: TextAlign.end ,
        style: TextStyle(
          color: Colors.teal.shade400,
          fontSize: 25,
        ),
      )
        ),
      ),
    );
  }
}
